/* automatically generated by rust-bindgen 0.72.1 */

#[repr(C)]
#[derive(Default)]
pub struct __IncompleteArrayField<T>(::core::marker::PhantomData<T>, [T; 0]);
impl<T> __IncompleteArrayField<T> {
    #[inline]
    pub const fn new() -> Self {
        __IncompleteArrayField(::core::marker::PhantomData, [])
    }
    #[inline]
    pub fn as_ptr(&self) -> *const T {
        self as *const _ as *const T
    }
    #[inline]
    pub fn as_mut_ptr(&mut self) -> *mut T {
        self as *mut _ as *mut T
    }
    #[inline]
    pub unsafe fn as_slice(&self, len: usize) -> &[T] {
        ::core::slice::from_raw_parts(self.as_ptr(), len)
    }
    #[inline]
    pub unsafe fn as_mut_slice(&mut self, len: usize) -> &mut [T] {
        ::core::slice::from_raw_parts_mut(self.as_mut_ptr(), len)
    }
}
impl<T> ::core::fmt::Debug for __IncompleteArrayField<T> {
    fn fmt(&self, fmt: &mut ::core::fmt::Formatter<'_>) -> ::core::fmt::Result {
        fmt.write_str("__IncompleteArrayField")
    }
}
pub const ULOOP_READ: u32 = 1;
pub const ULOOP_BLOCKING: u32 = 8;
pub type time_t = libc::c_long;
pub type uid_t = libc::c_uint;
pub type suseconds_t = libc::c_long;
pub type clock_t = libc::c_long;
pub type pid_t = libc::c_int;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct timeval {
    pub tv_sec: time_t,
    pub tv_usec: suseconds_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timeval"][::core::mem::size_of::<timeval>() - 16usize];
    ["Alignment of timeval"][::core::mem::align_of::<timeval>() - 8usize];
    ["Offset of field: timeval::tv_sec"][::core::mem::offset_of!(timeval, tv_sec) - 0usize];
    ["Offset of field: timeval::tv_usec"][::core::mem::offset_of!(timeval, tv_usec) - 8usize];
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct __sigset_t {
    pub __bits: [libc::c_ulong; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sigset_t"][::core::mem::size_of::<__sigset_t>() - 128usize];
    ["Alignment of __sigset_t"][::core::mem::align_of::<__sigset_t>() - 8usize];
    ["Offset of field: __sigset_t::__bits"][::core::mem::offset_of!(__sigset_t, __bits) - 0usize];
};
pub type sigset_t = __sigset_t;
#[repr(C, packed)]
pub struct blob_attr {
    pub id_len: u32,
    pub data: __IncompleteArrayField<libc::c_char>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of blob_attr"][::core::mem::size_of::<blob_attr>() - 4usize];
    ["Alignment of blob_attr"][::core::mem::align_of::<blob_attr>() - 1usize];
    ["Offset of field: blob_attr::id_len"][::core::mem::offset_of!(blob_attr, id_len) - 0usize];
    ["Offset of field: blob_attr::data"][::core::mem::offset_of!(blob_attr, data) - 4usize];
};
impl Default for blob_attr {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blob_buf {
    pub head: *mut blob_attr,
    pub grow: ::core::option::Option<
        unsafe extern "C" fn(buf: *mut blob_buf, minlen: libc::c_int) -> bool,
    >,
    pub buflen: libc::c_int,
    pub buf: *mut libc::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of blob_buf"][::core::mem::size_of::<blob_buf>() - 32usize];
    ["Alignment of blob_buf"][::core::mem::align_of::<blob_buf>() - 8usize];
    ["Offset of field: blob_buf::head"][::core::mem::offset_of!(blob_buf, head) - 0usize];
    ["Offset of field: blob_buf::grow"][::core::mem::offset_of!(blob_buf, grow) - 8usize];
    ["Offset of field: blob_buf::buflen"][::core::mem::offset_of!(blob_buf, buflen) - 16usize];
    ["Offset of field: blob_buf::buf"][::core::mem::offset_of!(blob_buf, buf) - 24usize];
};
impl Default for blob_buf {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    pub fn blob_buf_init(buf: *mut blob_buf, id: libc::c_int) -> libc::c_int;
}
unsafe extern "C" {
    pub fn blob_buf_free(buf: *mut blob_buf);
}
pub const blobmsg_type_BLOBMSG_TYPE_UNSPEC: blobmsg_type = blobmsg_type(0);
pub const blobmsg_type_BLOBMSG_TYPE_ARRAY: blobmsg_type = blobmsg_type(1);
pub const blobmsg_type_BLOBMSG_TYPE_TABLE: blobmsg_type = blobmsg_type(2);
pub const blobmsg_type_BLOBMSG_TYPE_STRING: blobmsg_type = blobmsg_type(3);
pub const blobmsg_type_BLOBMSG_TYPE_INT64: blobmsg_type = blobmsg_type(4);
pub const blobmsg_type_BLOBMSG_TYPE_INT32: blobmsg_type = blobmsg_type(5);
pub const blobmsg_type_BLOBMSG_TYPE_INT16: blobmsg_type = blobmsg_type(6);
pub const blobmsg_type_BLOBMSG_TYPE_INT8: blobmsg_type = blobmsg_type(7);
pub const blobmsg_type_BLOBMSG_TYPE_BOOL: blobmsg_type = blobmsg_type(7);
pub const blobmsg_type_BLOBMSG_TYPE_DOUBLE: blobmsg_type = blobmsg_type(8);
pub const blobmsg_type___BLOBMSG_TYPE_LAST: blobmsg_type = blobmsg_type(9);
pub const blobmsg_type_BLOBMSG_TYPE_LAST: blobmsg_type = blobmsg_type(8);
pub const blobmsg_type_BLOBMSG_CAST_INT64: blobmsg_type = blobmsg_type(9);
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct blobmsg_type(pub libc::c_uint);
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct blobmsg_policy {
    pub name: *const libc::c_char,
    pub type_: blobmsg_type,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of blobmsg_policy"][::core::mem::size_of::<blobmsg_policy>() - 16usize];
    ["Alignment of blobmsg_policy"][::core::mem::align_of::<blobmsg_policy>() - 8usize];
    ["Offset of field: blobmsg_policy::name"]
        [::core::mem::offset_of!(blobmsg_policy, name) - 0usize];
    ["Offset of field: blobmsg_policy::type_"]
        [::core::mem::offset_of!(blobmsg_policy, type_) - 8usize];
};
impl Default for blobmsg_policy {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    pub fn blobmsg_add_json_from_string(b: *mut blob_buf, str_: *const libc::c_char) -> bool;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union sigval {
    pub sival_int: libc::c_int,
    pub sival_ptr: *mut libc::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sigval"][::core::mem::size_of::<sigval>() - 8usize];
    ["Alignment of sigval"][::core::mem::align_of::<sigval>() - 8usize];
    ["Offset of field: sigval::sival_int"][::core::mem::offset_of!(sigval, sival_int) - 0usize];
    ["Offset of field: sigval::sival_ptr"][::core::mem::offset_of!(sigval, sival_ptr) - 0usize];
};
impl Default for sigval {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct siginfo_t {
    pub si_signo: libc::c_int,
    pub si_errno: libc::c_int,
    pub si_code: libc::c_int,
    pub __si_fields: siginfo_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union siginfo_t__bindgen_ty_1 {
    pub __pad: [libc::c_char; 112usize],
    pub __si_common: siginfo_t__bindgen_ty_1__bindgen_ty_1,
    pub __sigfault: siginfo_t__bindgen_ty_1__bindgen_ty_2,
    pub __sigpoll: siginfo_t__bindgen_ty_1__bindgen_ty_3,
    pub __sigsys: siginfo_t__bindgen_ty_1__bindgen_ty_4,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct siginfo_t__bindgen_ty_1__bindgen_ty_1 {
    pub __first: siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
    pub __second: siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 {
    pub __piduid: siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
    pub __timer: siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 {
    pub si_pid: pid_t,
    pub si_uid: uid_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>(
        ) - 8usize];
    ["Alignment of siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>(
        ) - 4usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::si_pid"] [:: core :: mem :: offset_of ! (siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 , si_pid) - 0usize] ;
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::si_uid"] [:: core :: mem :: offset_of ! (siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 , si_uid) - 4usize] ;
};
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2 {
    pub si_timerid: libc::c_int,
    pub si_overrun: libc::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2"]
        [::core::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2>(
        ) - 8usize];
    ["Alignment of siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2"]
        [::core::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2>(
        ) - 4usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2::si_timerid"] [:: core :: mem :: offset_of ! (siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2 , si_timerid) - 0usize] ;
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2::si_overrun"] [:: core :: mem :: offset_of ! (siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2 , si_overrun) - 4usize] ;
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Alignment of siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1>() - 4usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::__piduid"][::core::mem::offset_of!(
        siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        __piduid
    ) - 0usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1::__timer"][::core::mem::offset_of!(
        siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1,
        __timer
    ) - 0usize];
};
impl Default for siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2 {
    pub si_value: sigval,
    pub __sigchld: siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1 {
    pub si_status: libc::c_int,
    pub si_utime: clock_t,
    pub si_stime: clock_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1"]
        [::core::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1>(
        ) - 24usize];
    ["Alignment of siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1"]
        [::core::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1>(
        ) - 8usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1::si_status"] [:: core :: mem :: offset_of ! (siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1 , si_status) - 0usize] ;
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1::si_utime"] [:: core :: mem :: offset_of ! (siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1 , si_utime) - 8usize] ;
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1::si_stime"] [:: core :: mem :: offset_of ! (siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1 , si_stime) - 16usize] ;
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2"]
        [::core::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2>() - 24usize];
    ["Alignment of siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2"]
        [::core::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2::si_value"][::core::mem::offset_of!(
        siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2,
        si_value
    ) - 0usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2::__sigchld"][::core::mem::offset_of!(
        siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2,
        __sigchld
    ) - 0usize];
};
impl Default for siginfo_t__bindgen_ty_1__bindgen_ty_1__bindgen_ty_2 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of siginfo_t__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_1>() - 32usize];
    ["Alignment of siginfo_t__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_1::__first"]
        [::core::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_1, __first) - 0usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_1::__second"]
        [::core::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_1, __second) - 8usize];
};
impl Default for siginfo_t__bindgen_ty_1__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct siginfo_t__bindgen_ty_1__bindgen_ty_2 {
    pub si_addr: *mut libc::c_void,
    pub si_addr_lsb: libc::c_short,
    pub __first: siginfo_t__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union siginfo_t__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1 {
    pub __addr_bnd: siginfo_t__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1,
    pub si_pkey: libc::c_uint,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct siginfo_t__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1 {
    pub si_lower: *mut libc::c_void,
    pub si_upper: *mut libc::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of siginfo_t__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1>(
        ) - 16usize];
    ["Alignment of siginfo_t__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1>(
        ) - 8usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1::si_lower"] [:: core :: mem :: offset_of ! (siginfo_t__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1 , si_lower) - 0usize] ;
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1::si_upper"] [:: core :: mem :: offset_of ! (siginfo_t__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1 , si_upper) - 8usize] ;
};
impl Default for siginfo_t__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of siginfo_t__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1"]
        [::core::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1>() - 16usize];
    ["Alignment of siginfo_t__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1"]
        [::core::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1>() - 8usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1::__addr_bnd"][::core::mem::offset_of!(
        siginfo_t__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1,
        __addr_bnd
    )
        - 0usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1::si_pkey"][::core::mem::offset_of!(
        siginfo_t__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1,
        si_pkey
    ) - 0usize];
};
impl Default for siginfo_t__bindgen_ty_1__bindgen_ty_2__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of siginfo_t__bindgen_ty_1__bindgen_ty_2"]
        [::core::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_2>() - 32usize];
    ["Alignment of siginfo_t__bindgen_ty_1__bindgen_ty_2"]
        [::core::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_2::si_addr"]
        [::core::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_2, si_addr) - 0usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_2::si_addr_lsb"]
        [::core::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_2, si_addr_lsb) - 8usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_2::__first"]
        [::core::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_2, __first) - 16usize];
};
impl Default for siginfo_t__bindgen_ty_1__bindgen_ty_2 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct siginfo_t__bindgen_ty_1__bindgen_ty_3 {
    pub si_band: libc::c_long,
    pub si_fd: libc::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of siginfo_t__bindgen_ty_1__bindgen_ty_3"]
        [::core::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_3>() - 16usize];
    ["Alignment of siginfo_t__bindgen_ty_1__bindgen_ty_3"]
        [::core::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_3>() - 8usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_3::si_band"]
        [::core::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_3, si_band) - 0usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_3::si_fd"]
        [::core::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_3, si_fd) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct siginfo_t__bindgen_ty_1__bindgen_ty_4 {
    pub si_call_addr: *mut libc::c_void,
    pub si_syscall: libc::c_int,
    pub si_arch: libc::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of siginfo_t__bindgen_ty_1__bindgen_ty_4"]
        [::core::mem::size_of::<siginfo_t__bindgen_ty_1__bindgen_ty_4>() - 16usize];
    ["Alignment of siginfo_t__bindgen_ty_1__bindgen_ty_4"]
        [::core::mem::align_of::<siginfo_t__bindgen_ty_1__bindgen_ty_4>() - 8usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_4::si_call_addr"]
        [::core::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_4, si_call_addr) - 0usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_4::si_syscall"]
        [::core::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_4, si_syscall) - 8usize];
    ["Offset of field: siginfo_t__bindgen_ty_1__bindgen_ty_4::si_arch"]
        [::core::mem::offset_of!(siginfo_t__bindgen_ty_1__bindgen_ty_4, si_arch) - 12usize];
};
impl Default for siginfo_t__bindgen_ty_1__bindgen_ty_4 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of siginfo_t__bindgen_ty_1"]
        [::core::mem::size_of::<siginfo_t__bindgen_ty_1>() - 112usize];
    ["Alignment of siginfo_t__bindgen_ty_1"]
        [::core::mem::align_of::<siginfo_t__bindgen_ty_1>() - 8usize];
    ["Offset of field: siginfo_t__bindgen_ty_1::__pad"]
        [::core::mem::offset_of!(siginfo_t__bindgen_ty_1, __pad) - 0usize];
    ["Offset of field: siginfo_t__bindgen_ty_1::__si_common"]
        [::core::mem::offset_of!(siginfo_t__bindgen_ty_1, __si_common) - 0usize];
    ["Offset of field: siginfo_t__bindgen_ty_1::__sigfault"]
        [::core::mem::offset_of!(siginfo_t__bindgen_ty_1, __sigfault) - 0usize];
    ["Offset of field: siginfo_t__bindgen_ty_1::__sigpoll"]
        [::core::mem::offset_of!(siginfo_t__bindgen_ty_1, __sigpoll) - 0usize];
    ["Offset of field: siginfo_t__bindgen_ty_1::__sigsys"]
        [::core::mem::offset_of!(siginfo_t__bindgen_ty_1, __sigsys) - 0usize];
};
impl Default for siginfo_t__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of siginfo_t"][::core::mem::size_of::<siginfo_t>() - 128usize];
    ["Alignment of siginfo_t"][::core::mem::align_of::<siginfo_t>() - 8usize];
    ["Offset of field: siginfo_t::si_signo"][::core::mem::offset_of!(siginfo_t, si_signo) - 0usize];
    ["Offset of field: siginfo_t::si_errno"][::core::mem::offset_of!(siginfo_t, si_errno) - 4usize];
    ["Offset of field: siginfo_t::si_code"][::core::mem::offset_of!(siginfo_t, si_code) - 8usize];
    ["Offset of field: siginfo_t::__si_fields"]
        [::core::mem::offset_of!(siginfo_t, __si_fields) - 16usize];
};
impl Default for siginfo_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct sigaction {
    pub __sa_handler: sigaction__bindgen_ty_1,
    pub sa_mask: sigset_t,
    pub sa_flags: libc::c_int,
    pub sa_restorer: ::core::option::Option<unsafe extern "C" fn()>,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union sigaction__bindgen_ty_1 {
    pub sa_handler: ::core::option::Option<unsafe extern "C" fn(arg1: libc::c_int)>,
    pub sa_sigaction: ::core::option::Option<
        unsafe extern "C" fn(arg1: libc::c_int, arg2: *mut siginfo_t, arg3: *mut libc::c_void),
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sigaction__bindgen_ty_1"][::core::mem::size_of::<sigaction__bindgen_ty_1>() - 8usize];
    ["Alignment of sigaction__bindgen_ty_1"]
        [::core::mem::align_of::<sigaction__bindgen_ty_1>() - 8usize];
    ["Offset of field: sigaction__bindgen_ty_1::sa_handler"]
        [::core::mem::offset_of!(sigaction__bindgen_ty_1, sa_handler) - 0usize];
    ["Offset of field: sigaction__bindgen_ty_1::sa_sigaction"]
        [::core::mem::offset_of!(sigaction__bindgen_ty_1, sa_sigaction) - 0usize];
};
impl Default for sigaction__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sigaction"][::core::mem::size_of::<sigaction>() - 152usize];
    ["Alignment of sigaction"][::core::mem::align_of::<sigaction>() - 8usize];
    ["Offset of field: sigaction::__sa_handler"]
        [::core::mem::offset_of!(sigaction, __sa_handler) - 0usize];
    ["Offset of field: sigaction::sa_mask"][::core::mem::offset_of!(sigaction, sa_mask) - 8usize];
    ["Offset of field: sigaction::sa_flags"]
        [::core::mem::offset_of!(sigaction, sa_flags) - 136usize];
    ["Offset of field: sigaction::sa_restorer"]
        [::core::mem::offset_of!(sigaction, sa_restorer) - 144usize];
};
impl Default for sigaction {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct list_head {
    pub next: *mut list_head,
    pub prev: *mut list_head,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of list_head"][::core::mem::size_of::<list_head>() - 16usize];
    ["Alignment of list_head"][::core::mem::align_of::<list_head>() - 8usize];
    ["Offset of field: list_head::next"][::core::mem::offset_of!(list_head, next) - 0usize];
    ["Offset of field: list_head::prev"][::core::mem::offset_of!(list_head, prev) - 8usize];
};
impl Default for list_head {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type uloop_fd_handler =
    ::core::option::Option<unsafe extern "C" fn(u: *mut uloop_fd, events: libc::c_uint)>;
pub type uloop_timeout_handler =
    ::core::option::Option<unsafe extern "C" fn(t: *mut uloop_timeout)>;
pub type uloop_signal_handler = ::core::option::Option<unsafe extern "C" fn(s: *mut uloop_signal)>;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct uloop_fd {
    pub cb: uloop_fd_handler,
    pub fd: libc::c_int,
    pub eof: bool,
    pub error: bool,
    pub registered: bool,
    pub flags: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of uloop_fd"][::core::mem::size_of::<uloop_fd>() - 16usize];
    ["Alignment of uloop_fd"][::core::mem::align_of::<uloop_fd>() - 8usize];
    ["Offset of field: uloop_fd::cb"][::core::mem::offset_of!(uloop_fd, cb) - 0usize];
    ["Offset of field: uloop_fd::fd"][::core::mem::offset_of!(uloop_fd, fd) - 8usize];
    ["Offset of field: uloop_fd::eof"][::core::mem::offset_of!(uloop_fd, eof) - 12usize];
    ["Offset of field: uloop_fd::error"][::core::mem::offset_of!(uloop_fd, error) - 13usize];
    ["Offset of field: uloop_fd::registered"]
        [::core::mem::offset_of!(uloop_fd, registered) - 14usize];
    ["Offset of field: uloop_fd::flags"][::core::mem::offset_of!(uloop_fd, flags) - 15usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uloop_timeout {
    pub list: list_head,
    pub pending: bool,
    pub cb: uloop_timeout_handler,
    pub time: timeval,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of uloop_timeout"][::core::mem::size_of::<uloop_timeout>() - 48usize];
    ["Alignment of uloop_timeout"][::core::mem::align_of::<uloop_timeout>() - 8usize];
    ["Offset of field: uloop_timeout::list"][::core::mem::offset_of!(uloop_timeout, list) - 0usize];
    ["Offset of field: uloop_timeout::pending"]
        [::core::mem::offset_of!(uloop_timeout, pending) - 16usize];
    ["Offset of field: uloop_timeout::cb"][::core::mem::offset_of!(uloop_timeout, cb) - 24usize];
    ["Offset of field: uloop_timeout::time"]
        [::core::mem::offset_of!(uloop_timeout, time) - 32usize];
};
impl Default for uloop_timeout {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct uloop_signal {
    pub list: list_head,
    pub orig: sigaction,
    pub pending: bool,
    pub cb: uloop_signal_handler,
    pub signo: libc::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of uloop_signal"][::core::mem::size_of::<uloop_signal>() - 192usize];
    ["Alignment of uloop_signal"][::core::mem::align_of::<uloop_signal>() - 8usize];
    ["Offset of field: uloop_signal::list"][::core::mem::offset_of!(uloop_signal, list) - 0usize];
    ["Offset of field: uloop_signal::orig"][::core::mem::offset_of!(uloop_signal, orig) - 16usize];
    ["Offset of field: uloop_signal::pending"]
        [::core::mem::offset_of!(uloop_signal, pending) - 168usize];
    ["Offset of field: uloop_signal::cb"][::core::mem::offset_of!(uloop_signal, cb) - 176usize];
    ["Offset of field: uloop_signal::signo"]
        [::core::mem::offset_of!(uloop_signal, signo) - 184usize];
};
impl Default for uloop_signal {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    pub static mut uloop_cancelled: bool;
}
unsafe extern "C" {
    pub fn uloop_fd_add(sock: *mut uloop_fd, flags: libc::c_uint) -> libc::c_int;
}
unsafe extern "C" {
    pub fn uloop_fd_delete(sock: *mut uloop_fd) -> libc::c_int;
}
unsafe extern "C" {
    pub fn uloop_timeout_set(timeout: *mut uloop_timeout, msecs: libc::c_int) -> libc::c_int;
}
unsafe extern "C" {
    pub fn uloop_timeout_cancel(timeout: *mut uloop_timeout) -> libc::c_int;
}
unsafe extern "C" {
    pub fn uloop_signal_add(s: *mut uloop_signal) -> libc::c_int;
}
unsafe extern "C" {
    pub fn uloop_signal_delete(s: *mut uloop_signal) -> libc::c_int;
}
unsafe extern "C" {
    pub fn uloop_init() -> libc::c_int;
}
unsafe extern "C" {
    pub fn uloop_run_timeout(timeout: libc::c_int) -> libc::c_int;
}
unsafe extern "C" {
    pub fn uloop_done();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct avl_node {
    pub list: list_head,
    pub parent: *mut avl_node,
    pub left: *mut avl_node,
    pub right: *mut avl_node,
    pub key: *const libc::c_void,
    pub balance: libc::c_schar,
    pub leader: bool,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of avl_node"][::core::mem::size_of::<avl_node>() - 56usize];
    ["Alignment of avl_node"][::core::mem::align_of::<avl_node>() - 8usize];
    ["Offset of field: avl_node::list"][::core::mem::offset_of!(avl_node, list) - 0usize];
    ["Offset of field: avl_node::parent"][::core::mem::offset_of!(avl_node, parent) - 16usize];
    ["Offset of field: avl_node::left"][::core::mem::offset_of!(avl_node, left) - 24usize];
    ["Offset of field: avl_node::right"][::core::mem::offset_of!(avl_node, right) - 32usize];
    ["Offset of field: avl_node::key"][::core::mem::offset_of!(avl_node, key) - 40usize];
    ["Offset of field: avl_node::balance"][::core::mem::offset_of!(avl_node, balance) - 48usize];
    ["Offset of field: avl_node::leader"][::core::mem::offset_of!(avl_node, leader) - 49usize];
};
impl Default for avl_node {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type avl_tree_comp = ::core::option::Option<
    unsafe extern "C" fn(
        k1: *const libc::c_void,
        k2: *const libc::c_void,
        ptr: *mut libc::c_void,
    ) -> libc::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct avl_tree {
    pub list_head: list_head,
    pub root: *mut avl_node,
    pub count: libc::c_uint,
    pub allow_dups: bool,
    pub comp: avl_tree_comp,
    pub cmp_ptr: *mut libc::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of avl_tree"][::core::mem::size_of::<avl_tree>() - 48usize];
    ["Alignment of avl_tree"][::core::mem::align_of::<avl_tree>() - 8usize];
    ["Offset of field: avl_tree::list_head"][::core::mem::offset_of!(avl_tree, list_head) - 0usize];
    ["Offset of field: avl_tree::root"][::core::mem::offset_of!(avl_tree, root) - 16usize];
    ["Offset of field: avl_tree::count"][::core::mem::offset_of!(avl_tree, count) - 24usize];
    ["Offset of field: avl_tree::allow_dups"]
        [::core::mem::offset_of!(avl_tree, allow_dups) - 28usize];
    ["Offset of field: avl_tree::comp"][::core::mem::offset_of!(avl_tree, comp) - 32usize];
    ["Offset of field: avl_tree::cmp_ptr"][::core::mem::offset_of!(avl_tree, cmp_ptr) - 40usize];
};
impl Default for avl_tree {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C, packed(4))]
#[derive(Debug, Default, Copy, Clone)]
pub struct ubus_msghdr {
    pub version: u8,
    pub type_: u8,
    pub seq: u16,
    pub peer: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ubus_msghdr"][::core::mem::size_of::<ubus_msghdr>() - 8usize];
    ["Alignment of ubus_msghdr"][::core::mem::align_of::<ubus_msghdr>() - 4usize];
    ["Offset of field: ubus_msghdr::version"]
        [::core::mem::offset_of!(ubus_msghdr, version) - 0usize];
    ["Offset of field: ubus_msghdr::type_"][::core::mem::offset_of!(ubus_msghdr, type_) - 1usize];
    ["Offset of field: ubus_msghdr::seq"][::core::mem::offset_of!(ubus_msghdr, seq) - 2usize];
    ["Offset of field: ubus_msghdr::peer"][::core::mem::offset_of!(ubus_msghdr, peer) - 4usize];
};
pub const ubus_msg_status_UBUS_STATUS_OK: ubus_msg_status = ubus_msg_status(0);
pub const ubus_msg_status_UBUS_STATUS_INVALID_COMMAND: ubus_msg_status = ubus_msg_status(1);
pub const ubus_msg_status_UBUS_STATUS_INVALID_ARGUMENT: ubus_msg_status = ubus_msg_status(2);
pub const ubus_msg_status_UBUS_STATUS_METHOD_NOT_FOUND: ubus_msg_status = ubus_msg_status(3);
pub const ubus_msg_status_UBUS_STATUS_NOT_FOUND: ubus_msg_status = ubus_msg_status(4);
pub const ubus_msg_status_UBUS_STATUS_NO_DATA: ubus_msg_status = ubus_msg_status(5);
pub const ubus_msg_status_UBUS_STATUS_PERMISSION_DENIED: ubus_msg_status = ubus_msg_status(6);
pub const ubus_msg_status_UBUS_STATUS_TIMEOUT: ubus_msg_status = ubus_msg_status(7);
pub const ubus_msg_status_UBUS_STATUS_NOT_SUPPORTED: ubus_msg_status = ubus_msg_status(8);
pub const ubus_msg_status_UBUS_STATUS_UNKNOWN_ERROR: ubus_msg_status = ubus_msg_status(9);
pub const ubus_msg_status_UBUS_STATUS_CONNECTION_FAILED: ubus_msg_status = ubus_msg_status(10);
pub const ubus_msg_status_UBUS_STATUS_NO_MEMORY: ubus_msg_status = ubus_msg_status(11);
pub const ubus_msg_status_UBUS_STATUS_PARSE_ERROR: ubus_msg_status = ubus_msg_status(12);
pub const ubus_msg_status_UBUS_STATUS_SYSTEM_ERROR: ubus_msg_status = ubus_msg_status(13);
pub const ubus_msg_status___UBUS_STATUS_LAST: ubus_msg_status = ubus_msg_status(14);
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct ubus_msg_status(pub libc::c_uint);
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ubus_msghdr_buf {
    pub hdr: ubus_msghdr,
    pub data: *mut blob_attr,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ubus_msghdr_buf"][::core::mem::size_of::<ubus_msghdr_buf>() - 16usize];
    ["Alignment of ubus_msghdr_buf"][::core::mem::align_of::<ubus_msghdr_buf>() - 8usize];
    ["Offset of field: ubus_msghdr_buf::hdr"]
        [::core::mem::offset_of!(ubus_msghdr_buf, hdr) - 0usize];
    ["Offset of field: ubus_msghdr_buf::data"]
        [::core::mem::offset_of!(ubus_msghdr_buf, data) - 8usize];
};
impl Default for ubus_msghdr_buf {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type ubus_handler_t = ::core::option::Option<
    unsafe extern "C" fn(
        ctx: *mut ubus_context,
        obj: *mut ubus_object,
        req: *mut ubus_request_data,
        method: *const libc::c_char,
        msg: *mut blob_attr,
    ) -> libc::c_int,
>;
pub type ubus_state_handler_t =
    ::core::option::Option<unsafe extern "C" fn(ctx: *mut ubus_context, obj: *mut ubus_object)>;
pub type ubus_event_handler_t = ::core::option::Option<
    unsafe extern "C" fn(
        ctx: *mut ubus_context,
        ev: *mut ubus_event_handler,
        type_: *const libc::c_char,
        msg: *mut blob_attr,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ubus_method {
    pub name: *const libc::c_char,
    pub handler: ubus_handler_t,
    pub mask: libc::c_ulong,
    pub tags: libc::c_ulong,
    pub policy: *const blobmsg_policy,
    pub n_policy: libc::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ubus_method"][::core::mem::size_of::<ubus_method>() - 48usize];
    ["Alignment of ubus_method"][::core::mem::align_of::<ubus_method>() - 8usize];
    ["Offset of field: ubus_method::name"][::core::mem::offset_of!(ubus_method, name) - 0usize];
    ["Offset of field: ubus_method::handler"]
        [::core::mem::offset_of!(ubus_method, handler) - 8usize];
    ["Offset of field: ubus_method::mask"][::core::mem::offset_of!(ubus_method, mask) - 16usize];
    ["Offset of field: ubus_method::tags"][::core::mem::offset_of!(ubus_method, tags) - 24usize];
    ["Offset of field: ubus_method::policy"]
        [::core::mem::offset_of!(ubus_method, policy) - 32usize];
    ["Offset of field: ubus_method::n_policy"]
        [::core::mem::offset_of!(ubus_method, n_policy) - 40usize];
};
impl Default for ubus_method {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ubus_object_type {
    pub name: *const libc::c_char,
    pub id: u32,
    pub methods: *const ubus_method,
    pub n_methods: libc::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ubus_object_type"][::core::mem::size_of::<ubus_object_type>() - 32usize];
    ["Alignment of ubus_object_type"][::core::mem::align_of::<ubus_object_type>() - 8usize];
    ["Offset of field: ubus_object_type::name"]
        [::core::mem::offset_of!(ubus_object_type, name) - 0usize];
    ["Offset of field: ubus_object_type::id"]
        [::core::mem::offset_of!(ubus_object_type, id) - 8usize];
    ["Offset of field: ubus_object_type::methods"]
        [::core::mem::offset_of!(ubus_object_type, methods) - 16usize];
    ["Offset of field: ubus_object_type::n_methods"]
        [::core::mem::offset_of!(ubus_object_type, n_methods) - 24usize];
};
impl Default for ubus_object_type {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ubus_object {
    pub avl: avl_node,
    pub name: *const libc::c_char,
    pub id: u32,
    pub path: *const libc::c_char,
    pub type_: *mut ubus_object_type,
    pub subscribe_cb: ubus_state_handler_t,
    pub has_subscribers: bool,
    pub methods: *const ubus_method,
    pub n_methods: libc::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ubus_object"][::core::mem::size_of::<ubus_object>() - 120usize];
    ["Alignment of ubus_object"][::core::mem::align_of::<ubus_object>() - 8usize];
    ["Offset of field: ubus_object::avl"][::core::mem::offset_of!(ubus_object, avl) - 0usize];
    ["Offset of field: ubus_object::name"][::core::mem::offset_of!(ubus_object, name) - 56usize];
    ["Offset of field: ubus_object::id"][::core::mem::offset_of!(ubus_object, id) - 64usize];
    ["Offset of field: ubus_object::path"][::core::mem::offset_of!(ubus_object, path) - 72usize];
    ["Offset of field: ubus_object::type_"][::core::mem::offset_of!(ubus_object, type_) - 80usize];
    ["Offset of field: ubus_object::subscribe_cb"]
        [::core::mem::offset_of!(ubus_object, subscribe_cb) - 88usize];
    ["Offset of field: ubus_object::has_subscribers"]
        [::core::mem::offset_of!(ubus_object, has_subscribers) - 96usize];
    ["Offset of field: ubus_object::methods"]
        [::core::mem::offset_of!(ubus_object, methods) - 104usize];
    ["Offset of field: ubus_object::n_methods"]
        [::core::mem::offset_of!(ubus_object, n_methods) - 112usize];
};
impl Default for ubus_object {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ubus_event_handler {
    pub obj: ubus_object,
    pub cb: ubus_event_handler_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ubus_event_handler"][::core::mem::size_of::<ubus_event_handler>() - 128usize];
    ["Alignment of ubus_event_handler"][::core::mem::align_of::<ubus_event_handler>() - 8usize];
    ["Offset of field: ubus_event_handler::obj"]
        [::core::mem::offset_of!(ubus_event_handler, obj) - 0usize];
    ["Offset of field: ubus_event_handler::cb"]
        [::core::mem::offset_of!(ubus_event_handler, cb) - 120usize];
};
impl Default for ubus_event_handler {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct ubus_context {
    pub requests: list_head,
    pub objects: avl_tree,
    pub pending: list_head,
    pub sock: uloop_fd,
    pub pending_timer: uloop_timeout,
    pub local_id: u32,
    pub request_seq: u16,
    pub cancel_poll: bool,
    pub stack_depth: libc::c_int,
    pub connection_lost: ::core::option::Option<unsafe extern "C" fn(ctx: *mut ubus_context)>,
    pub monitor_cb: ::core::option::Option<
        unsafe extern "C" fn(ctx: *mut ubus_context, seq: u32, data: *mut blob_attr),
    >,
    pub msgbuf: ubus_msghdr_buf,
    pub msgbuf_data_len: u32,
    pub msgbuf_reduction_counter: libc::c_int,
    pub __bindgen_anon_1: ubus_context__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union ubus_context__bindgen_ty_1 {
    pub __bindgen_anon_1: ubus_context__bindgen_ty_1__bindgen_ty_1,
    pub __bindgen_anon_2: ubus_context__bindgen_ty_1__bindgen_ty_2,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ubus_context__bindgen_ty_1__bindgen_ty_1 {
    pub auto_subscribers: list_head,
    pub auto_subscribe_event_handler: ubus_event_handler,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ubus_context__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::size_of::<ubus_context__bindgen_ty_1__bindgen_ty_1>() - 144usize];
    ["Alignment of ubus_context__bindgen_ty_1__bindgen_ty_1"]
        [::core::mem::align_of::<ubus_context__bindgen_ty_1__bindgen_ty_1>() - 8usize];
    ["Offset of field: ubus_context__bindgen_ty_1__bindgen_ty_1::auto_subscribers"][::core::mem::offset_of!(
        ubus_context__bindgen_ty_1__bindgen_ty_1,
        auto_subscribers
    ) - 0usize];
    ["Offset of field: ubus_context__bindgen_ty_1__bindgen_ty_1::auto_subscribe_event_handler"][::core::mem::offset_of!(
        ubus_context__bindgen_ty_1__bindgen_ty_1,
        auto_subscribe_event_handler
    )
        - 16usize];
};
impl Default for ubus_context__bindgen_ty_1__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct ubus_context__bindgen_ty_1__bindgen_ty_2 {
    pub request_handler: ubus_handler_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ubus_context__bindgen_ty_1__bindgen_ty_2"]
        [::core::mem::size_of::<ubus_context__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Alignment of ubus_context__bindgen_ty_1__bindgen_ty_2"]
        [::core::mem::align_of::<ubus_context__bindgen_ty_1__bindgen_ty_2>() - 8usize];
    ["Offset of field: ubus_context__bindgen_ty_1__bindgen_ty_2::request_handler"][::core::mem::offset_of!(
        ubus_context__bindgen_ty_1__bindgen_ty_2,
        request_handler
    ) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ubus_context__bindgen_ty_1"]
        [::core::mem::size_of::<ubus_context__bindgen_ty_1>() - 144usize];
    ["Alignment of ubus_context__bindgen_ty_1"]
        [::core::mem::align_of::<ubus_context__bindgen_ty_1>() - 8usize];
};
impl Default for ubus_context__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ubus_context"][::core::mem::size_of::<ubus_context>() - 344usize];
    ["Alignment of ubus_context"][::core::mem::align_of::<ubus_context>() - 8usize];
    ["Offset of field: ubus_context::requests"]
        [::core::mem::offset_of!(ubus_context, requests) - 0usize];
    ["Offset of field: ubus_context::objects"]
        [::core::mem::offset_of!(ubus_context, objects) - 16usize];
    ["Offset of field: ubus_context::pending"]
        [::core::mem::offset_of!(ubus_context, pending) - 64usize];
    ["Offset of field: ubus_context::sock"][::core::mem::offset_of!(ubus_context, sock) - 80usize];
    ["Offset of field: ubus_context::pending_timer"]
        [::core::mem::offset_of!(ubus_context, pending_timer) - 96usize];
    ["Offset of field: ubus_context::local_id"]
        [::core::mem::offset_of!(ubus_context, local_id) - 144usize];
    ["Offset of field: ubus_context::request_seq"]
        [::core::mem::offset_of!(ubus_context, request_seq) - 148usize];
    ["Offset of field: ubus_context::cancel_poll"]
        [::core::mem::offset_of!(ubus_context, cancel_poll) - 150usize];
    ["Offset of field: ubus_context::stack_depth"]
        [::core::mem::offset_of!(ubus_context, stack_depth) - 152usize];
    ["Offset of field: ubus_context::connection_lost"]
        [::core::mem::offset_of!(ubus_context, connection_lost) - 160usize];
    ["Offset of field: ubus_context::monitor_cb"]
        [::core::mem::offset_of!(ubus_context, monitor_cb) - 168usize];
    ["Offset of field: ubus_context::msgbuf"]
        [::core::mem::offset_of!(ubus_context, msgbuf) - 176usize];
    ["Offset of field: ubus_context::msgbuf_data_len"]
        [::core::mem::offset_of!(ubus_context, msgbuf_data_len) - 192usize];
    ["Offset of field: ubus_context::msgbuf_reduction_counter"]
        [::core::mem::offset_of!(ubus_context, msgbuf_reduction_counter) - 196usize];
};
impl Default for ubus_context {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ubus_acl_key {
    pub user: *const libc::c_char,
    pub group: *const libc::c_char,
    pub object: *const libc::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ubus_acl_key"][::core::mem::size_of::<ubus_acl_key>() - 24usize];
    ["Alignment of ubus_acl_key"][::core::mem::align_of::<ubus_acl_key>() - 8usize];
    ["Offset of field: ubus_acl_key::user"][::core::mem::offset_of!(ubus_acl_key, user) - 0usize];
    ["Offset of field: ubus_acl_key::group"][::core::mem::offset_of!(ubus_acl_key, group) - 8usize];
    ["Offset of field: ubus_acl_key::object"]
        [::core::mem::offset_of!(ubus_acl_key, object) - 16usize];
};
impl Default for ubus_acl_key {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ubus_request_data {
    pub object: u32,
    pub peer: u32,
    pub seq: u16,
    pub acl: ubus_acl_key,
    pub deferred: bool,
    pub fd: libc::c_int,
    pub req_fd: libc::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ubus_request_data"][::core::mem::size_of::<ubus_request_data>() - 56usize];
    ["Alignment of ubus_request_data"][::core::mem::align_of::<ubus_request_data>() - 8usize];
    ["Offset of field: ubus_request_data::object"]
        [::core::mem::offset_of!(ubus_request_data, object) - 0usize];
    ["Offset of field: ubus_request_data::peer"]
        [::core::mem::offset_of!(ubus_request_data, peer) - 4usize];
    ["Offset of field: ubus_request_data::seq"]
        [::core::mem::offset_of!(ubus_request_data, seq) - 8usize];
    ["Offset of field: ubus_request_data::acl"]
        [::core::mem::offset_of!(ubus_request_data, acl) - 16usize];
    ["Offset of field: ubus_request_data::deferred"]
        [::core::mem::offset_of!(ubus_request_data, deferred) - 40usize];
    ["Offset of field: ubus_request_data::fd"]
        [::core::mem::offset_of!(ubus_request_data, fd) - 44usize];
    ["Offset of field: ubus_request_data::req_fd"]
        [::core::mem::offset_of!(ubus_request_data, req_fd) - 48usize];
};
impl Default for ubus_request_data {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    pub fn ubus_connect(path: *const libc::c_char) -> *mut ubus_context;
}
unsafe extern "C" {
    pub fn ubus_reconnect(ctx: *mut ubus_context, path: *const libc::c_char) -> libc::c_int;
}
unsafe extern "C" {
    pub fn ubus_free(ctx: *mut ubus_context);
}
unsafe extern "C" {
    pub fn ubus_lookup_id(
        ctx: *mut ubus_context,
        path: *const libc::c_char,
        id: *mut u32,
    ) -> libc::c_int;
}
unsafe extern "C" {
    pub fn ubus_add_object(ctx: *mut ubus_context, obj: *mut ubus_object) -> libc::c_int;
}
unsafe extern "C" {
    pub fn ubus_remove_object(ctx: *mut ubus_context, obj: *mut ubus_object) -> libc::c_int;
}
unsafe extern "C" {
    pub fn ubus_send_reply(
        ctx: *mut ubus_context,
        req: *mut ubus_request_data,
        msg: *mut blob_attr,
    ) -> libc::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uci_list {
    pub next: *mut uci_list,
    pub prev: *mut uci_list,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of uci_list"][::core::mem::size_of::<uci_list>() - 16usize];
    ["Alignment of uci_list"][::core::mem::align_of::<uci_list>() - 8usize];
    ["Offset of field: uci_list::next"][::core::mem::offset_of!(uci_list, next) - 0usize];
    ["Offset of field: uci_list::prev"][::core::mem::offset_of!(uci_list, prev) - 8usize];
};
impl Default for uci_list {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
unsafe extern "C" {
    pub fn uci_alloc_context() -> *mut uci_context;
}
unsafe extern "C" {
    pub fn uci_free_context(ctx: *mut uci_context);
}
unsafe extern "C" {
    pub fn uci_load(
        ctx: *mut uci_context,
        name: *const libc::c_char,
        package: *mut *mut uci_package,
    ) -> libc::c_int;
}
unsafe extern "C" {
    pub fn uci_unload(ctx: *mut uci_context, p: *mut uci_package) -> libc::c_int;
}
unsafe extern "C" {
    pub fn uci_lookup_ptr(
        ctx: *mut uci_context,
        ptr: *mut uci_ptr,
        str_: *mut libc::c_char,
        extended: bool,
    ) -> libc::c_int;
}
unsafe extern "C" {
    pub fn uci_set_confdir(ctx: *mut uci_context, dir: *const libc::c_char) -> libc::c_int;
}
unsafe extern "C" {
    pub fn uci_lookup_next(
        ctx: *mut uci_context,
        e: *mut *mut uci_element,
        list: *mut uci_list,
        name: *const libc::c_char,
    ) -> libc::c_int;
}
pub const uci_type_UCI_TYPE_UNSPEC: uci_type = uci_type(0);
pub const uci_type_UCI_TYPE_DELTA: uci_type = uci_type(1);
pub const uci_type_UCI_TYPE_PACKAGE: uci_type = uci_type(2);
pub const uci_type_UCI_TYPE_SECTION: uci_type = uci_type(3);
pub const uci_type_UCI_TYPE_OPTION: uci_type = uci_type(4);
pub const uci_type_UCI_TYPE_PATH: uci_type = uci_type(5);
pub const uci_type_UCI_TYPE_BACKEND: uci_type = uci_type(6);
pub const uci_type_UCI_TYPE_ITEM: uci_type = uci_type(7);
pub const uci_type_UCI_TYPE_HOOK: uci_type = uci_type(8);
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct uci_type(pub libc::c_uint);
pub const uci_option_type_UCI_TYPE_STRING: uci_option_type = uci_option_type(0);
pub const uci_option_type_UCI_TYPE_LIST: uci_option_type = uci_option_type(1);
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct uci_option_type(pub libc::c_uint);
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uci_element {
    pub list: uci_list,
    pub type_: uci_type,
    pub name: *mut libc::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of uci_element"][::core::mem::size_of::<uci_element>() - 32usize];
    ["Alignment of uci_element"][::core::mem::align_of::<uci_element>() - 8usize];
    ["Offset of field: uci_element::list"][::core::mem::offset_of!(uci_element, list) - 0usize];
    ["Offset of field: uci_element::type_"][::core::mem::offset_of!(uci_element, type_) - 16usize];
    ["Offset of field: uci_element::name"][::core::mem::offset_of!(uci_element, name) - 24usize];
};
impl Default for uci_element {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uci_backend {
    pub e: uci_element,
    pub list_configs: ::core::option::Option<
        unsafe extern "C" fn(ctx: *mut uci_context) -> *mut *mut libc::c_char,
    >,
    pub load: ::core::option::Option<
        unsafe extern "C" fn(ctx: *mut uci_context, name: *const libc::c_char) -> *mut uci_package,
    >,
    pub commit: ::core::option::Option<
        unsafe extern "C" fn(ctx: *mut uci_context, p: *mut *mut uci_package, overwrite: bool),
    >,
    pub ptr: *const libc::c_void,
    pub priv_: *mut libc::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of uci_backend"][::core::mem::size_of::<uci_backend>() - 72usize];
    ["Alignment of uci_backend"][::core::mem::align_of::<uci_backend>() - 8usize];
    ["Offset of field: uci_backend::e"][::core::mem::offset_of!(uci_backend, e) - 0usize];
    ["Offset of field: uci_backend::list_configs"]
        [::core::mem::offset_of!(uci_backend, list_configs) - 32usize];
    ["Offset of field: uci_backend::load"][::core::mem::offset_of!(uci_backend, load) - 40usize];
    ["Offset of field: uci_backend::commit"]
        [::core::mem::offset_of!(uci_backend, commit) - 48usize];
    ["Offset of field: uci_backend::ptr"][::core::mem::offset_of!(uci_backend, ptr) - 56usize];
    ["Offset of field: uci_backend::priv_"][::core::mem::offset_of!(uci_backend, priv_) - 64usize];
};
impl Default for uci_backend {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[repr(align(8))]
pub struct uci_context {
    pub _bindgen_opaque_blob: [u64; 42usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of uci_context"][::core::mem::size_of::<uci_context>() - 336usize];
    ["Alignment of uci_context"][::core::mem::align_of::<uci_context>() - 8usize];
};
impl Default for uci_context {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uci_package {
    pub e: uci_element,
    pub sections: uci_list,
    pub ctx: *mut uci_context,
    pub has_delta: bool,
    pub uses_conf2: bool,
    pub path: *mut libc::c_char,
    pub backend: *mut uci_backend,
    pub priv_: *mut libc::c_void,
    pub n_section: libc::c_int,
    pub delta: uci_list,
    pub saved_delta: uci_list,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of uci_package"][::core::mem::size_of::<uci_package>() - 128usize];
    ["Alignment of uci_package"][::core::mem::align_of::<uci_package>() - 8usize];
    ["Offset of field: uci_package::e"][::core::mem::offset_of!(uci_package, e) - 0usize];
    ["Offset of field: uci_package::sections"]
        [::core::mem::offset_of!(uci_package, sections) - 32usize];
    ["Offset of field: uci_package::ctx"][::core::mem::offset_of!(uci_package, ctx) - 48usize];
    ["Offset of field: uci_package::has_delta"]
        [::core::mem::offset_of!(uci_package, has_delta) - 56usize];
    ["Offset of field: uci_package::uses_conf2"]
        [::core::mem::offset_of!(uci_package, uses_conf2) - 57usize];
    ["Offset of field: uci_package::path"][::core::mem::offset_of!(uci_package, path) - 64usize];
    ["Offset of field: uci_package::backend"]
        [::core::mem::offset_of!(uci_package, backend) - 72usize];
    ["Offset of field: uci_package::priv_"][::core::mem::offset_of!(uci_package, priv_) - 80usize];
    ["Offset of field: uci_package::n_section"]
        [::core::mem::offset_of!(uci_package, n_section) - 88usize];
    ["Offset of field: uci_package::delta"][::core::mem::offset_of!(uci_package, delta) - 96usize];
    ["Offset of field: uci_package::saved_delta"]
        [::core::mem::offset_of!(uci_package, saved_delta) - 112usize];
};
impl Default for uci_package {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uci_section {
    pub e: uci_element,
    pub options: uci_list,
    pub package: *mut uci_package,
    pub anonymous: bool,
    pub type_: *mut libc::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of uci_section"][::core::mem::size_of::<uci_section>() - 72usize];
    ["Alignment of uci_section"][::core::mem::align_of::<uci_section>() - 8usize];
    ["Offset of field: uci_section::e"][::core::mem::offset_of!(uci_section, e) - 0usize];
    ["Offset of field: uci_section::options"]
        [::core::mem::offset_of!(uci_section, options) - 32usize];
    ["Offset of field: uci_section::package"]
        [::core::mem::offset_of!(uci_section, package) - 48usize];
    ["Offset of field: uci_section::anonymous"]
        [::core::mem::offset_of!(uci_section, anonymous) - 56usize];
    ["Offset of field: uci_section::type_"][::core::mem::offset_of!(uci_section, type_) - 64usize];
};
impl Default for uci_section {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct uci_option {
    pub e: uci_element,
    pub section: *mut uci_section,
    pub type_: uci_option_type,
    pub v: uci_option__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union uci_option__bindgen_ty_1 {
    pub list: uci_list,
    pub string: *mut libc::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of uci_option__bindgen_ty_1"]
        [::core::mem::size_of::<uci_option__bindgen_ty_1>() - 16usize];
    ["Alignment of uci_option__bindgen_ty_1"]
        [::core::mem::align_of::<uci_option__bindgen_ty_1>() - 8usize];
    ["Offset of field: uci_option__bindgen_ty_1::list"]
        [::core::mem::offset_of!(uci_option__bindgen_ty_1, list) - 0usize];
    ["Offset of field: uci_option__bindgen_ty_1::string"]
        [::core::mem::offset_of!(uci_option__bindgen_ty_1, string) - 0usize];
};
impl Default for uci_option__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of uci_option"][::core::mem::size_of::<uci_option>() - 64usize];
    ["Alignment of uci_option"][::core::mem::align_of::<uci_option>() - 8usize];
    ["Offset of field: uci_option::e"][::core::mem::offset_of!(uci_option, e) - 0usize];
    ["Offset of field: uci_option::section"]
        [::core::mem::offset_of!(uci_option, section) - 32usize];
    ["Offset of field: uci_option::type_"][::core::mem::offset_of!(uci_option, type_) - 40usize];
    ["Offset of field: uci_option::v"][::core::mem::offset_of!(uci_option, v) - 48usize];
};
impl Default for uci_option {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct uci_ptr {
    pub target: uci_type,
    pub flags: uci_ptr__bindgen_ty_1,
    pub p: *mut uci_package,
    pub s: *mut uci_section,
    pub o: *mut uci_option,
    pub last: *mut uci_element,
    pub package: *const libc::c_char,
    pub section: *const libc::c_char,
    pub option: *const libc::c_char,
    pub value: *const libc::c_char,
}
pub const uci_ptr_UCI_LOOKUP_DONE: uci_ptr__bindgen_ty_1 = uci_ptr__bindgen_ty_1(1);
pub const uci_ptr_UCI_LOOKUP_COMPLETE: uci_ptr__bindgen_ty_1 = uci_ptr__bindgen_ty_1(2);
pub const uci_ptr_UCI_LOOKUP_EXTENDED: uci_ptr__bindgen_ty_1 = uci_ptr__bindgen_ty_1(4);
#[repr(transparent)]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub struct uci_ptr__bindgen_ty_1(pub libc::c_uint);
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of uci_ptr"][::core::mem::size_of::<uci_ptr>() - 72usize];
    ["Alignment of uci_ptr"][::core::mem::align_of::<uci_ptr>() - 8usize];
    ["Offset of field: uci_ptr::target"][::core::mem::offset_of!(uci_ptr, target) - 0usize];
    ["Offset of field: uci_ptr::flags"][::core::mem::offset_of!(uci_ptr, flags) - 4usize];
    ["Offset of field: uci_ptr::p"][::core::mem::offset_of!(uci_ptr, p) - 8usize];
    ["Offset of field: uci_ptr::s"][::core::mem::offset_of!(uci_ptr, s) - 16usize];
    ["Offset of field: uci_ptr::o"][::core::mem::offset_of!(uci_ptr, o) - 24usize];
    ["Offset of field: uci_ptr::last"][::core::mem::offset_of!(uci_ptr, last) - 32usize];
    ["Offset of field: uci_ptr::package"][::core::mem::offset_of!(uci_ptr, package) - 40usize];
    ["Offset of field: uci_ptr::section"][::core::mem::offset_of!(uci_ptr, section) - 48usize];
    ["Offset of field: uci_ptr::option"][::core::mem::offset_of!(uci_ptr, option) - 56usize];
    ["Offset of field: uci_ptr::value"][::core::mem::offset_of!(uci_ptr, value) - 64usize];
};
impl Default for uci_ptr {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
